1． 题目： 简化的 C 语言（或其它高级语言）词法分析程序设计（个人题目）
设计内容及要求：自己定义一个简单程序设计语言的单词集及其编码规则，并把词
法分析器构造出来。

保留字的识别按标识符一样识别，通过查找保留字表区分是保留字还是标识符。
程序能够从用户输入的源程序中，识别出的单词符号，
并用二元式表示，显示输出或输出到文件中。

## 简化的C语言

所有符号限制在ASCII码范围内，不对其他编码、符号适用。

##### 关键字

```c
auto	break	case	char	const	continue	default	do	double	else	enum	extern	float	for	goto	if	int	long	register	return	short	signed	sizeof	static	struct	switch	typedef	unsigned	union	void	volatile	while	_Bool	_Complex	_Imaginary	inline	restrict		_Alignas	_Alignof	_Atomic	_Generic	_Noreturn	_Static_assert	_Thread_local	
```

关键字包含了ANSI C和C99，C11的关键字。

##### 运算符

```c
	:		?		+		-		++		--		+=		-=		*		/		*=		/=		%		&		>		<		>=		<=		==		!=		&&		||		!		^		|		=
```

##### 分隔符

```c
(	)	{	}	;	,
```

分隔符包含圆括号，花括号，分号和逗号。方括号在C中表示数组下标或指针偏移，在C++中视作运算符而不是分隔符，比较复杂，这里没有保留。

##### 分词

分词采用的方法包含：

1.  使用空格和换行分割
2.  使用分隔符分割。注意分隔符也是有意义的，保留分隔符
3.  不同种类的词之间分割开
4.  前后两个词（此时把空格也算独立的词）应当是可以直接相连的

除关键字、运算符和分隔符使用有穷的列表直接定义，其他的分词均使用正则式作为判断工具。其中判断一个串是不是一个独立的词则结合使用列表和正则表达式。

##### 语法限制

1.  目前对格式化输入输出的支持不到位。
2.  不支持三目运算符、数组下标和指针偏移的方括号这样的运算符
3.  对数字的支持仅限于小数和整数，不判断数值范围是否合法，不支持指数表示法，不支持十进制之外的形式等。具体限制以采用的正则表达式为准。
4.  字符串处理不解析转义字符，不为值加字符串结束符‘\0’，但字符串的引号会被去除，不作为值的一部分。
5.  

## 错误报告

词法分析面对的错误是无法从接下来的字符串里读出一个满足五种词中任意一种的单词，即词法错误。

词法错误是必须再词法分析阶段报告的，而可以对简单而明显的语法错误，比如不应该连续出现的两种词，像两个标识符连续出现，选择报告错误可以更早的结束对错误文档的处理，避免浪费更多时间。

